In [1]:
#Pandas==>open source library==>> data manipulation 

#data structure :
# 1. series = 1-D ==> only values
# 2. Data frame ==> multi dimensional ==> values with column names

In [2]:
import pandas as pd

In [5]:
a={
    "id":[1,2,3,4,5],
    "Name":['sam', 'garvit','rahul','raj','rani'],
    "Department":['IT','IT','HR','OPERATIONS','IT'],
    "Working_hours":[8,9,8,8,9],
    "Salary":[34000,22000,56000,52000,55000]
}

In [6]:
df = pd.DataFrame(a)
df

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

# how to get top 5 data?

In [7]:
df.head()

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

In [8]:
df.head(3)

   id    Name Department  Working_hours  Salary
0   1     sam         IT              8   34000
1   2  garvit         IT              9   22000
2   3   rahul         HR              8   56000

# bottom data

In [10]:
df.tail()

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

In [11]:
df.tail(2)

   id  Name  Department  Working_hours  Salary
3   4   raj  OPERATIONS              8   52000
4   5  rani          IT              9   55000

# Random indexed data

In [12]:
df.sample(3)

   id   Name Department  Working_hours  Salary
2   3  rahul         HR              8   56000
4   5   rani         IT              9   55000
0   1    sam         IT              8   34000

In [13]:
df.info() # a complete overivew of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             5 non-null      int64
 1   Name           5 non-null      object
 2   Department     5 non-null      object
 3   Working_hours  5 non-null      int64
 4   Salary         5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes

In [14]:
df.describe() # statically view of data

             id  Working_hours        Salary
count  5.000000       5.000000      5.000000
mean   3.000000       8.400000  43800.000000
std    1.581139       0.547723  15106.290081
min    1.000000       8.000000  22000.000000
25%    2.000000       8.000000  34000.000000
50%    3.000000       8.000000  52000.000000
75%    4.000000       9.000000  55000.000000
max    5.000000       9.000000  56000.000000

In [15]:
df.columns

Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [16]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')]

In [17]:
# loc and iloc == data extraction
# df.loc[raw_range , column_name]==> silicing == starting and last value include
# df.iloc [raw_range,column_range]==> silicing == starting value include last value excluded

In [19]:
df.loc[:2, ['id','Salary']]

   id  Salary
0   1   34000
1   2   22000
2   3   56000

In [20]:
df.iloc[:2, [0,1,3]]

   id    Name  Working_hours
0   1     sam              8
1   2  garvit              9

# How to get csv data into pandas?

In [22]:
df= pd.read_csv("C:\\Users\\jyoti\\OneDrive\\Desktop\\New folder\\covid_toy.csv")

In [23]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [27]:
df.to_csv("C:\\Users\\jyoti\\OneDrive\\Desktop\\Newfolder_covid_toy.csv", index = False)

In [28]:
# value counts()==> total of sub cattegories in a category

In [29]:
df['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [30]:
df['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

In [31]:
a={
    "id":[1,2,3,4,5],
    "Name":['sam', 'garvit','rahul','raj','rani'],
    "Department":['IT','IT','HR','OPERATIONS','IT'],
    "Working_hours":[8,9,8,8,9],
    "Salary":[34000,22000,56000,52000,55000]
}

In [35]:
df= pd.DataFrame(a)
df

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

In [38]:
df.sort_values(by="Salary")

   id    Name  Department  Working_hours  Salary
1   2  garvit          IT              9   22000
0   1     sam          IT              8   34000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000
2   3   rahul          HR              8   56000

In [39]:
df.sort_index()

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

In [40]:
df['Salary'].astype(float) # we can change  data type of elements

0    34000.0
1    22000.0
2    56000.0
3    52000.0
4    55000.0
Name: Salary, dtype: float64

In [41]:
df['Salary'].astype(int)

0    34000
1    22000
2    56000
3    52000
4    55000
Name: Salary, dtype: int32

In [42]:
df['Salary'].add(1000)

0    35000
1    23000
2    57000
3    53000
4    56000
Name: Salary, dtype: int64

In [43]:
df.count() # to check frequency

id               5
Name             5
Department       5
Working_hours    5
Salary           5
dtype: int64

In [44]:
df.min()

id                    1
Name             garvit
Department           HR
Working_hours         8
Salary            22000
dtype: object

In [45]:
df.max()

id                        5
Name                    sam
Department       OPERATIONS
Working_hours             9
Salary                56000
dtype: object

In [48]:
df.sum()

id                                  15
Name             samgarvitrahulrajrani
Department          ITITHROPERATIONSIT
Working_hours                       42
Salary                          219000
dtype: object

In [49]:
df

   id    Name  Department  Working_hours  Salary
0   1     sam          IT              8   34000
1   2  garvit          IT              9   22000
2   3   rahul          HR              8   56000
3   4     raj  OPERATIONS              8   52000
4   5    rani          IT              9   55000

In [52]:
df.filter(items=['Name', 'Department'])

     Name  Department
0     sam          IT
1  garvit          IT
2   rahul          HR
3     raj  OPERATIONS
4    rani          IT

In [53]:
df[['Name', 'Department']]

     Name  Department
0     sam          IT
1  garvit          IT
2   rahul          HR
3     raj  OPERATIONS
4    rani          IT

In [54]:
df.filter(items= [2,3] ,axis=0)

   id   Name  Department  Working_hours  Salary
2   3  rahul          HR              8   56000
3   4    raj  OPERATIONS              8   52000

In [55]:
df.to_dict() # save data into dictionary

{'id': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
 'Name': {0: 'sam', 1: 'garvit', 2: 'rahul', 3: 'raj', 4: 'rani'},
 'Department': {0: 'IT', 1: 'IT', 2: 'HR', 3: 'OPERATIONS', 4: 'IT'},
 'Working_hours': {0: 8, 1: 9, 2: 8, 3: 8, 4: 9},
 'Salary': {0: 34000, 1: 22000, 2: 56000, 3: 52000, 4: 55000}}

In [56]:
df.to_string() #save data into string

'   id    Name  Department  Working_hours  Salary\n0   1     sam          IT              8   34000\n1   2  garvit          IT              9   22000\n2   3   rahul          HR              8   56000\n3   4     raj  OPERATIONS              8   52000\n4   5    rani          IT              9   55000'

In [57]:
df.columns[0:2]  #starting columns labels

Index(['id', 'Name'], dtype='object')

In [58]:
df.columns.tolist() #save into list of column label

['id', 'Name', 'Department', 'Working_hours', 'Salary']

In [59]:
df.columns.values # array of columns labels

array(['id', 'Name', 'Department', 'Working_hours', 'Salary'],
      dtype=object)

In [60]:
df.rename(columns={'Name': 'updated_Name',
                  'Salary': 'updated_Salary'})

   id updated_Name  Department  Working_hours  updated_Salary
0   1          sam          IT              8           34000
1   2       garvit          IT              9           22000
2   3        rahul          HR              8           56000
3   4          raj  OPERATIONS              8           52000
4   5         rani          IT              9           55000

In [61]:
df['New_Salary_Record']= df['Salary'].where(df['Salary']>=40000,other=0)

In [62]:
df

   id    Name  Department  Working_hours  Salary  New_Salary_Record
0   1     sam          IT              8   34000                  0
1   2  garvit          IT              9   22000                  0
2   3   rahul          HR              8   56000              56000
3   4     raj  OPERATIONS              8   52000              52000
4   5    rani          IT              9   55000              55000